--
-- Created by IntelliJ IDEA.
-- @author: ElanWu
-- @date: 2017/02/06 10:57
-- To change this template use File | Settings | File Templates.
--SkillData

SkillDef = {}


SkillDef.ZS_LIEHUO_CD = 10 --战士的战圣烈焰冷却CD 单位是秒

SkillDef.SKILL_LEARN_STATE = {
    UNABLE = 0,
    CANUP = 1, -- 可升级
    CANLEARN = 2, -- 可学习
    MAXLEVEL = 3, -- 最大等级
    UNLEARN = 4, -- 未满足条件 不能学习
    UNUP = 5, -- 未满足条件 不能升级
}

-- 每个职业的技能
SkillDef.SKILL_LIST = {
    [Const.JOB_ZS] = {
        -- 战士
        101,102,103,104,105,106,109,110,111,112,113,
    },
    [Const.JOB_FS] = {
        -- 法师
		401,402,405,409,411,412,414,417,418,419,420,421,
    },
    [Const.JOB_DS] = {
        -- 道士
		504,501,502,503,505,506,507,508,509,512,519,514,513,518,520,521,522,523,
    },
}

SkillDef.SKILL_ZS_LIST = {
    [Const.JOB_ZS] = {
--        [Const.SKILL_TYPE_PoTianZhan] = {Const.SKILL_TYPE_LieHuoJianFa},
        --        [Const.SKILL_TYPE_ZhuRiJianFa] = {Const.SKILL_TYPE_PoTianZhan, Const.SKILL_TYPE_LieHuoJianFa},
    },
    [Const.JOB_FS] = {
--        [Const.SKILL_TYPE_HuoLongQiYan] = {Const.SKILL_TYPE_BingPaoXiao},
--        [Const.SKILL_TYPE_LiuXingHuoYu] = {Const.SKILL_TYPE_HuoLongQiYan, Const.SKILL_TYPE_BingPaoXiao},
    },
    [Const.JOB_DS] = {
        --        [Const.SKILL_TYPE_ZhaoHuanYueLing] = {Const.SKILL_TYPE_ZhaoHuanShenShou},
    },
}

-- 被动技能
SkillDef.PASSIVE_LIST = {
    [Const.JOB_ZS] = {
     101,102,
    },
    [Const.JOB_FS] = {
 
    },
    [Const.JOB_DS] = {
        
      502,
    }
}

-- 辅助技能
SkillDef.ASSIST_LIST = {
    [Const.JOB_ZS] = {
     105,
    },
    [Const.JOB_FS] = {
     402,412,418,
    },
    [Const.JOB_DS] = {
    501,505,506,507,508,509,512,513,514,518,520,522,
    }
}

-- 单体技能
SkillDef.SIGNLE_LIST = {
    [Const.JOB_ZS] = {
       106,
    },
    [Const.JOB_FS] = {
        401,405,420,
    },
    [Const.JOB_DS] = {
       503,504,521,
    }
}
-- 群体技能
SkillDef.AROUND_LIST = {
    [Const.JOB_ZS] = {
        103,104,109,110,111,112,113
    },
    [Const.JOB_FS] = {
       409,411,414,417,418,419,421
    },
    [Const.JOB_DS] = {
        519,523,
    }
}

SkillDef.EFFECT_DESP_LIST = {
    [101] = {
{"提升<font color='#12cf28'>3</font>点命中,被动技."},
{"提升<font color='#12cf28'>6</font>点命中,被动技."},
{"提升<font color='#12cf28'>9</font>点命中,被动技."},

    },
	
  [102] = {
{"增加<font color='#12cf28'>6</font>点普通攻击的伤害,被动技."},
{"增加<font color='#12cf28'>7</font>点普通攻击的伤害,被动技."},
{"增加<font color='#12cf28'>8</font>点普通攻击的伤害,被动技."},


},
 [103] = {
{"开启后,普通攻击对前方小范围造成<font color='#12cf28'>60</font>%的溅射伤害"},
{"开启后,普通攻击对前方小范围造成<font color='#12cf28'>80</font>%的溅射伤害"},
{"开启后,普通攻击对前方小范围造成<font color='#12cf28'>100</font>%的溅射伤害"},

	},
	
 [104] = {	
	{"开启后,普通攻击附带剑气,对自身周围的敌人造成<font color='#12cf28'>12.5</font>%的范围伤害"},
{"开启后,普通攻击附带剑气,对自身周围的敌人造成<font color='#12cf28'>25</font>%的范围伤害"},
{"开启后,普通攻击附带剑气,对自身周围的敌人造成<font color='#12cf28'>37.5</font>%的范围伤害"},
},

 [105] = {
{"向前冲撞一段距离,同时击退沿途怪物,冷却时间为5秒."},
{"向前冲撞一段距离,同时击退沿途怪物,冷却时间为5秒.提高冲撞距离."},
{"向前冲撞一段距离,同时击退沿途怪物,冷却时间为5秒.提高冲撞距离."},
},

 [106] = {
{"强大单体伤害技,有一定几率造成3倍伤害.冷却时间为10秒"},
{"强大单体伤害技,有一定几率造成3倍伤害.冷却时间为10秒,提高伤害"},
{"强大单体伤害技,有一定几率造成3倍伤害.冷却时间为10秒,提高伤害"},
{"强大单体伤害技,有一定几率造成3倍伤害.冷却时间为10秒,提高伤害"},
{"强大单体伤害技,有一定几率造成3倍伤害.冷却时间为10秒,提高伤害"},
{"强大单体伤害技,有一定几率造成3倍伤害.冷却时间为10秒,提高伤害"},
{"强大单体伤害技,有一定几率造成3倍伤害.冷却时间为10秒,提高伤害"},
{"强大单体伤害技,有一定几率造成3倍伤害.冷却时间为10秒,提高伤害"},
{"强大单体伤害技,有一定几率造成3倍伤害.冷却时间为10秒,提高伤害"},
{"强大单体伤害技,有一定几率造成3倍伤害.冷却时间为10秒,提高伤害"},
},

 [109] = {
{"威力大于战圣烈焰,攻击身前二格目标,冷却时间为10秒."},
{"威力大于战圣烈焰,攻击身前二格目标,冷却时间为10秒.提高伤害"},
{"威力大于战圣烈焰,攻击身前二格目标,冷却时间为10秒.提高伤害"},
{"威力大于战圣烈焰,攻击身前二格目标,冷却时间为10秒.提高伤害"},
{"威力大于战圣烈焰,攻击身前二格目标,冷却时间为10秒.提高伤害"},
{"威力大于战圣烈焰,攻击身前二格目标,冷却时间为10秒.提高伤害"},
{"威力大于战圣烈焰,攻击身前二格目标,冷却时间为10秒.提高伤害"},
{"威力大于战圣烈焰,攻击身前二格目标,冷却时间为10秒.提高伤害"},
{"威力大于战圣烈焰,攻击身前二格目标,冷却时间为10秒.提高伤害"},
{"威力大于战圣烈焰,攻击身前二格目标,冷却时间为10秒.提高伤害"},
},

 [110] = {
{"向正面冲撞4格距离,并造成80%的普攻伤害,冷却时间为5秒."},
{"向正面冲撞4格距离,并造成80%的普攻伤害,冷却时间为5秒.提高伤害"},
{"向正面冲撞4格距离,并造成80%的普攻伤害,冷却时间为5秒.提高伤害"},
{"向正面冲撞4格距离,并造成80%的普攻伤害,冷却时间为5秒.提高伤害"},
{"向正面冲撞4格距离,并造成80%的普攻伤害,冷却时间为5秒.提高伤害"},
{"向正面冲撞4格距离,并造成80%的普攻伤害,冷却时间为5秒.提高伤害"},
{"向正面冲撞4格距离,并造成80%的普攻伤害,冷却时间为5秒.提高伤害"},
{"向正面冲撞4格距离,并造成80%的普攻伤害,冷却时间为5秒.提高伤害"},
{"向正面冲撞4格距离,并造成80%的普攻伤害,冷却时间为5秒.提高伤害"},
{"向正面冲撞4格距离,并造成80%的普攻伤害,冷却时间为5秒.提高伤害"},
},

 [111] = {
{"威力大于奔雷剑法,攻击身前三格目标,冷却时间为10秒."},
{"威力大于奔雷剑法,攻击身前三格目标,冷却时间为10秒.提高伤害"},
{"威力大于奔雷剑法,攻击身前三格目标,冷却时间为10秒.提高伤害"},
{"威力大于奔雷剑法,攻击身前三格目标,冷却时间为10秒.提高伤害"},
{"威力大于奔雷剑法,攻击身前三格目标,冷却时间为10秒.提高伤害"},
{"威力大于奔雷剑法,攻击身前三格目标,冷却时间为10秒.提高伤害"},
{"威力大于奔雷剑法,攻击身前三格目标,冷却时间为10秒.提高伤害"},
{"威力大于奔雷剑法,攻击身前三格目标,冷却时间为10秒.提高伤害"},
{"威力大于奔雷剑法,攻击身前三格目标,冷却时间为10秒.提高伤害"},
{"威力大于奔雷剑法,攻击身前三格目标,冷却时间为10秒.提高伤害"},
},

 [112] = {
{"对正前方3个方向发出3道刺杀剑气."},
{"对正前方3个方向发出3道刺杀剑气.提高伤害"},
{"对正前方3个方向发出3道刺杀剑气.提高伤害"},
{"对正前方3个方向发出3道刺杀剑气.提高伤害"},
{"对正前方3个方向发出3道刺杀剑气.提高伤害"},
{"对正前方3个方向发出3道刺杀剑气.提高伤害"},
{"对正前方3个方向发出3道刺杀剑气.提高伤害"},
{"对正前方3个方向发出3道刺杀剑气.提高伤害"},
{"对正前方3个方向发出3道刺杀剑气.提高伤害"},
{"对正前方3个方向发出3道刺杀剑气.提高伤害"},
},

 [113] = {
{"威力大于破空剑法,攻击身前四格目标,冷却时间为10秒."},
{"威力大于破空剑法,攻击身前四格目标,冷却时间为10秒.提高伤害"},
{"威力大于破空剑法,攻击身前四格目标,冷却时间为10秒.提高伤害"},
{"威力大于破空剑法,攻击身前四格目标,冷却时间为10秒.提高伤害"},
{"威力大于破空剑法,攻击身前四格目标,冷却时间为10秒.提高伤害"},
{"威力大于破空剑法,攻击身前四格目标,冷却时间为10秒.提高伤害"},
{"威力大于破空剑法,攻击身前四格目标,冷却时间为10秒.提高伤害"},
{"威力大于破空剑法,攻击身前四格目标,冷却时间为10秒.提高伤害"},
{"威力大于破空剑法,攻击身前四格目标,冷却时间为10秒.提高伤害"},
{"威力大于破空剑法,攻击身前四格目标,冷却时间为10秒.提高伤害"},
},

 [401] = {
{"对敌方单体造成火焰伤害."},
{"对敌方单体造成火焰伤害.提高伤害"},
{"对敌方单体造成火焰伤害.提高伤害"},

},

 [402] = {
{"将自身附近敌人推离,只对比自身等级低的敌人生效."},
{"将自身附近敌人推离,只对比自身等级低的敌人生效.提高推动距离"},
{"将自身附近敌人推离,只对比自身等级低的敌人生效.提高推动距离"},

},
 [405] = {
{"对敌方单体造成雷电伤害."},
{"对敌方单体造成雷电伤害.提高伤害"},
{"对敌方单体造成雷电伤害.提高伤害"},
},
 [409] = {
{"释放一片火墙,踏入此范围内的怪物将受到持续的燃烧伤害."},
{"释放一片火墙,踏入此范围内的怪物将受到持续的燃烧伤害.提高伤害"},
{"释放一片火墙,踏入此范围内的怪物将受到持续的燃烧伤害.提高伤害"},
},
 [411] = {
{"以自身为中心,对自身范围内的怪物进行群体伤害."},
{"以自身为中心,对自身范围内的怪物进行群体伤害.提高伤害"},
{"以自身为中心,对自身范围内的怪物进行群体伤害.提高伤害"},
},

 [412] = {
{"使用后形成魔法保护层,减少自身受到的伤害."},
{"使用后形成魔法保护层,减少自身受到的伤害.提高减伤效果"},
{"使用后形成魔法保护层,减少自身受到的伤害.提高减伤效果"},
},

 [414] = {
{"召唤寒冰风暴,造成范围群体伤害."},
{"召唤寒冰风暴,造成范围群体伤害.提高伤害"},
{"召唤寒冰风暴,造成范围群体伤害.提高伤害"},
{"召唤寒冰风暴,造成范围群体伤害.提高伤害"},
{"召唤寒冰风暴,造成范围群体伤害.提高伤害"},
{"召唤寒冰风暴,造成范围群体伤害.提高伤害"},
{"召唤寒冰风暴,造成范围群体伤害.提高伤害"},
{"召唤寒冰风暴,造成范围群体伤害.提高伤害"},
{"召唤寒冰风暴,造成范围群体伤害.提高伤害"},
{"召唤寒冰风暴,造成范围群体伤害.提高伤害"},
},

 [417] = {
{"对目标周围造成强力的群体法术伤害."},
{"对目标周围造成强力的群体法术伤害.提高伤害"},
{"对目标周围造成强力的群体法术伤害.提高伤害"},
{"对目标周围造成强力的群体法术伤害.提高伤害"},
{"对目标周围造成强力的群体法术伤害.提高伤害"},
{"对目标周围造成强力的群体法术伤害.提高伤害"},
{"对目标周围造成强力的群体法术伤害.提高伤害"},
{"对目标周围造成强力的群体法术伤害.提高伤害"},
{"对目标周围造成强力的群体法术伤害.提高伤害"},
{"对目标周围造成强力的群体法术伤害.提高伤害"},
},

 [418] = {
{"使用后形成魔法保护层,减伤效果高于法神灵盾."},
{"使用后形成魔法保护层,减伤效果高于法神灵盾.提高减伤效果"},
{"使用后形成魔法保护层,减伤效果高于法神灵盾.提高减伤效果"},
{"使用后形成魔法保护层,减伤效果高于法神灵盾.提高减伤效果"},
{"使用后形成魔法保护层,减伤效果高于法神灵盾.提高减伤效果"},
{"使用后形成魔法保护层,减伤效果高于法神灵盾.提高减伤效果"},
{"使用后形成魔法保护层,减伤效果高于法神灵盾.提高减伤效果"},
{"使用后形成魔法保护层,减伤效果高于法神灵盾.提高减伤效果"},
{"使用后形成魔法保护层,减伤效果高于法神灵盾.提高减伤效果"},
{"使用后形成魔法保护层,减伤效果高于法神灵盾.提高减伤效果"},
},

 [419] = {
{"对目标周围造成强力的群体法术伤害.威力高于龙之烈焰."},
{"对目标周围造成强力的群体法术伤害.威力高于龙之烈焰.提高伤害"},
{"对目标周围造成强力的群体法术伤害.威力高于龙之烈焰.提高伤害"},
{"对目标周围造成强力的群体法术伤害.威力高于龙之烈焰.提高伤害"},
{"对目标周围造成强力的群体法术伤害.威力高于龙之烈焰.提高伤害"},
{"对目标周围造成强力的群体法术伤害.威力高于龙之烈焰.提高伤害"},
{"对目标周围造成强力的群体法术伤害.威力高于龙之烈焰.提高伤害"},
{"对目标周围造成强力的群体法术伤害.威力高于龙之烈焰.提高伤害"},
{"对目标周围造成强力的群体法术伤害.威力高于龙之烈焰.提高伤害"},
{"对目标周围造成强力的群体法术伤害.威力高于龙之烈焰.提高伤害"},
},

 [420] = {
{"丢出一个冰球造成伤害,有几率击退敌人."},
{"丢出一个冰球造成伤害,有几率击退敌人.提高伤害"},
{"丢出一个冰球造成伤害,有几率击退敌人.提高伤害"},
{"丢出一个冰球造成伤害,有几率击退敌人.提高伤害"},
{"丢出一个冰球造成伤害,有几率击退敌人.提高伤害"},
{"丢出一个冰球造成伤害,有几率击退敌人.提高伤害"},
{"丢出一个冰球造成伤害,有几率击退敌人.提高伤害"},
{"丢出一个冰球造成伤害,有几率击退敌人.提高伤害"},
{"丢出一个冰球造成伤害,有几率击退敌人.提高伤害"},
{"丢出一个冰球造成伤害,有几率击退敌人.提高伤害"},
},

 [421] = {
{"对目标周围造成强力的群体法术伤害.威力高于烈火燎原."},
{"对目标周围造成强力的群体法术伤害.威力高于烈火燎原.提高伤害"},
{"对目标周围造成强力的群体法术伤害.威力高于烈火燎原.提高伤害"},
{"对目标周围造成强力的群体法术伤害.威力高于烈火燎原.提高伤害"},
{"对目标周围造成强力的群体法术伤害.威力高于烈火燎原.提高伤害"},
{"对目标周围造成强力的群体法术伤害.威力高于烈火燎原.提高伤害"},
{"对目标周围造成强力的群体法术伤害.威力高于烈火燎原.提高伤害"},
{"对目标周围造成强力的群体法术伤害.威力高于烈火燎原.提高伤害"},
{"对目标周围造成强力的群体法术伤害.威力高于烈火燎原.提高伤害"},
{"对目标周围造成强力的群体法术伤害.威力高于烈火燎原.提高伤害"},
},

 [501] = {
{"回复自身生命值."},
{"回复自身生命值.提高加血效果"},
{"回复自身生命值.提高加血效果"},
},

 [502] = {
{"提升自身命中率.被动技."},
{"提升自身命中率.被动技.增加命中率"},
{"提升自身命中率.被动技.增加命中率"},
},

 [503] = {
{"使目标进入中毒状态,造成持续掉血并降低防御."},
{"使目标进入中毒状态,造成持续掉血并降低防御.提高伤害,削弱防御"},
{"使目标进入中毒状态,造成持续掉血并降低防御.提高伤害,削弱防御"},
},

 [504] = {
{"释放灵符,造成单体伤害."},
{"释放灵符,造成单体伤害.提高伤害"},
{"释放灵符,造成单体伤害.提高伤害"},
},

 [505] = {
{"召唤变异骷髅为自己作战."},
{"召唤变异骷髅为自己作战.提高伤害"},
{"召唤变异骷髅为自己作战.提高伤害"},
},

 [506] = {
{"进入隐身状态,使周围怪物无法察觉自身的存在."},
{"进入隐身状态,使周围怪物无法察觉自身的存在.提高持续时间"},
{"进入隐身状态,使周围怪物无法察觉自身的存在.提高持续时间"},
},

 [507] = {
{"使范围内的友方目标进入隐身状态,周围怪物无法察觉这些目标的存在."},
{"使范围内的友方目标进入隐身状态,周围怪物无法察觉这些目标的存在.提高持续时间"},
{"使范围内的友方目标进入隐身状态,周围怪物无法察觉这些目标的存在.提高持续时间"},
},

 [508] = {
{"提高范围内友方目标的魔法防御力."},
{"提高范围内友方目标的魔法防御力.提高防御效果"},
{"提高范围内友方目标的魔法防御力.提高防御效果"},
},

 [509] = {
{"提高范围内友方目标的物理防御力."},
{"提高范围内友方目标的物理防御力.提高防御效果"},
{"提高范围内友方目标的物理防御力.提高防御效果"},
},

 [512] = {
{"回复范围内友方目标的生命值."},
{"回复范围内友方目标的生命值.提高回复效果"},
{"回复范围内友方目标的生命值.提高回复效果"},
},

 [513] = {
{"召唤一只强大的神兽为自己作战."},
{"召唤一只强大的神兽为自己作战.提高伤害"},
{"召唤一只强大的神兽为自己作战.提高伤害"},
{"召唤一只强大的神兽为自己作战.提高伤害"},
{"召唤一只强大的神兽为自己作战.提高伤害"},
{"召唤一只强大的神兽为自己作战.提高伤害"},
{"召唤一只强大的神兽为自己作战.提高伤害"},
{"召唤一只强大的神兽为自己作战.提高伤害"},
{"召唤一只强大的神兽为自己作战.提高伤害"},
{"召唤一只强大的神兽为自己作战.提高伤害"},
},

 [514] = {
{"将自身附近敌人推离,只对比自身等级低的敌人生效."},
{"将自身附近敌人推离,只对比自身等级低的敌人生效.提高推动距离"},
{"将自身附近敌人推离,只对比自身等级低的敌人生效.提高推动距离"},
},

 [518] = {
{"召唤出拥有群攻技能的特殊生物妖灵为自己作战."},
{"召唤出拥有群攻技能的特殊生物妖灵为自己作战.提高伤害"},
{"召唤出拥有群攻技能的特殊生物妖灵为自己作战.提高伤害"},
{"召唤出拥有群攻技能的特殊生物妖灵为自己作战.提高伤害"},
{"召唤出拥有群攻技能的特殊生物妖灵为自己作战.提高伤害"},
{"召唤出拥有群攻技能的特殊生物妖灵为自己作战.提高伤害"},
{"召唤出拥有群攻技能的特殊生物妖灵为自己作战.提高伤害"},
{"召唤出拥有群攻技能的特殊生物妖灵为自己作战.提高伤害"},
{"召唤出拥有群攻技能的特殊生物妖灵为自己作战.提高伤害"},
{"召唤出拥有群攻技能的特殊生物妖灵为自己作战.提高伤害"},
},

 [519] = {
{"使群体目标进入中毒状态,造成持续掉血并降低防御."},
{"使群体目标进入中毒状态,造成持续掉血并降低防御.提高伤害,削弱防御"},
{"使群体目标进入中毒状态,造成持续掉血并降低防御.提高伤害,削弱防御"},
},


 [520] = {
{"一定时间内减少目标攻击力."},
{"一定时间内减少目标攻击力.增加时间,提高减攻效果"},
{"一定时间内减少目标攻击力.增加时间,提高减攻效果"},
{"一定时间内减少目标攻击力.增加时间,提高减攻效果"},
{"一定时间内减少目标攻击力.增加时间,提高减攻效果"},
{"一定时间内减少目标攻击力.增加时间,提高减攻效果"},
{"一定时间内减少目标攻击力.增加时间,提高减攻效果"},
{"一定时间内减少目标攻击力.增加时间,提高减攻效果"},
{"一定时间内减少目标攻击力.增加时间,提高减攻效果"},
{"一定时间内减少目标攻击力.增加时间,提高减攻效果"},
},

 [521] = {
{"对选中目标释放剑雨,造成单体伤害,威力高于天魂灵符."},
{"对选中目标释放剑雨,造成单体伤害,威力高于天魂灵符.提高伤害"},
{"对选中目标释放剑雨,造成单体伤害,威力高于天魂灵符.提高伤害"},
{"对选中目标释放剑雨,造成单体伤害,威力高于天魂灵符.提高伤害"},
{"对选中目标释放剑雨,造成单体伤害,威力高于天魂灵符.提高伤害"},
{"对选中目标释放剑雨,造成单体伤害,威力高于天魂灵符.提高伤害"},
{"对选中目标释放剑雨,造成单体伤害,威力高于天魂灵符.提高伤害"},
{"对选中目标释放剑雨,造成单体伤害,威力高于天魂灵符.提高伤害"},
{"对选中目标释放剑雨,造成单体伤害,威力高于天魂灵符.提高伤害"},
{"对选中目标释放剑雨,造成单体伤害,威力高于天魂灵符.提高伤害"},
},

 [522] = {
{"召唤出拥有群攻技能的特殊生物白虎为自己作战,属性高于妖灵."},
{"召唤出拥有群攻技能的特殊生物白虎为自己作战,属性高于妖灵.提高伤害"},
{"召唤出拥有群攻技能的特殊生物白虎为自己作战,属性高于妖灵.提高伤害"},
{"召唤出拥有群攻技能的特殊生物白虎为自己作战,属性高于妖灵.提高伤害"},
{"召唤出拥有群攻技能的特殊生物白虎为自己作战,属性高于妖灵.提高伤害"},
{"召唤出拥有群攻技能的特殊生物白虎为自己作战,属性高于妖灵.提高伤害"},
{"召唤出拥有群攻技能的特殊生物白虎为自己作战,属性高于妖灵.提高伤害"},
{"召唤出拥有群攻技能的特殊生物白虎为自己作战,属性高于妖灵.提高伤害"},
{"召唤出拥有群攻技能的特殊生物白虎为自己作战,属性高于妖灵.提高伤害"},
{"召唤出拥有群攻技能的特殊生物白虎为自己作战,属性高于妖灵.提高伤害"},
},

 [523] = {
{"对目标范围造成群体伤害."},
{"对目标范围造成群体伤害.提高伤害"},
{"对目标范围造成群体伤害.提高伤害"},
{"对目标范围造成群体伤害.提高伤害"},
{"对目标范围造成群体伤害.提高伤害"},
{"对目标范围造成群体伤害.提高伤害"},
{"对目标范围造成群体伤害.提高伤害"},
{"对目标范围造成群体伤害.提高伤害"},
{"对目标范围造成群体伤害.提高伤害"},
{"对目标范围造成群体伤害.提高伤害"},
},

}

-- 自动学习的技能列表
SkillDef.AUTO_LEARN_LIST = {
    [Const.JOB_ZS] = {
        103,104,105,106,
    },
    [Const.JOB_FS] = {
        401,402,405,409,411,412,
    },
    [Const.JOB_DS] = {
        501,503,504,505,506,507,508,509,512,514,
    }
}

SkillDef.skillPos = {
    [Const.JOB_ZS] = {
        [1] = Const.SKILL_TYPE_YiBanGongJi,
        [2] = Const.SKILL_TYPE_CiShaJianShu,
        [3] = Const.SKILL_TYPE_BanYueWanDao,
        [4] = Const.SKILL_TYPE_YeManChongZhuang,
        [5] = Const.SKILL_TYPE_LieHuoJianFa,
    },
    [Const.JOB_FS] = {
        [1] = Const.SKILL_TYPE_LeiDianShu,
        [2] = Const.SKILL_TYPE_KangJuHuoHuan,
        [3] = Const.SKILL_TYPE_HuoQiang,
        [4] = Const.SKILL_TYPE_DiYuLeiGuang,
        [5] = Const.SKILL_TYPE_MoFaDun,
        [6] = Const.SKILL_TYPE_BingPaoXiao,
    },
    [Const.JOB_DS] = {
        [1] = Const.SKILL_TYPE_LingHunHuoFu,
        [2] = Const.SKILL_TYPE_ZhiYuShu,
        [3] = Const.SKILL_TYPE_ShiDuShu,
        [4] = Const.SKILL_TYPE_ZhaoHuanKuLou,
        [5] = Const.SKILL_TYPE_YouLingDun,
        [6] = Const.SKILL_TYPE_ShenShengZhanJiaShu,
        [7] = SKILL_TYPE_QunTiZhiLiao,
        [8] = Const.SKILL_TYPE_ZhaoHuanShenShou,
    }
}